Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/fees_and_supports_for_third_level_education/grants_and_funds_available_for_mature_students.html.txt.tmx
Source language: en
Languages: ga

source: Grants and funds available for mature students
ga: Deontais agus cistí atá ar fáil do mhic léinn aibí

source: • Schemes to help with fees and maintenance
ga: • Scéimeanna a chabhraíonn le táillí agus cothabháil

source: If you wish to enter or return to third-level education and you are over 23 years of age, Irish third-level colleges have places for mature students
ga: Más mian leat tús a chur le ar nó filleadh ar oideachas tríú leibhéil agus má tá tú 23 bliana d'aois nó níos mó, tá áiteanna ag coláistí agus ollscoileanna Éireannacha ar a gcuid cúrsaí do mhic léinn lánfhásta

source: You will have to consider the costs of fees and maintenance, depending on whether you are going to do a full-time or a part-time course
ga: Beidh ort costas na dtáillí agus costas cothabhála a chur san áireamh ag brath ar cé acu a bhfuil ar intinn agat, cúrsa lánaimseartha nó páirtaimseartha

source: Depending on your circumstances, you may be eligible for free fees
ga: Ag brath ar do chuid cúinsí féadann tú a bheith i dteideal táillí saor ó chostas

source: If you are planning to study full-time as an undergraduate, you may be eligible for a student grant
ga: Má tá tú ar intinn staidéar lánaimseartha mar fhochéimí a dhéanamh, féadann tú a bheith i dteideal deontas do mhic léinn a fháil

source: (If you are applying for an undergraduate course and you have already completed an undergraduate course, you are not eligible for either a student grant or free fees.)
ga: (Má tá tú ag déanamh iarratais ar chúrsa fochéime níl tú i dteideal deontais do mhic léinn nó táillí saor ó chostas má bhain tú fochéim amach cheana féin.)

source: If you are applying for a postgraduate course you will have to pay fees, unless you get a partial student grant
ga: Má tá tú ag cur isteach ar chúrsa fochéime beidh ort táillí a íoc mura bhfaigheann tú deontas cothabhála

source: You will also have to pay fees if you are intending to study part-time or do a distance learning course
ga: Beidh ort táillí a íoc má tá sé ar intinn agat staidéar páirtaimseartha nó cúrsa cianfoghlamtha a dhéanamh

source: If you do have to pay fees you may be able to get tax relief at the standard rate
ga: Más rud é go gcaithfidh tú táillí a íoc, féadann tú faoiseamh cánach ag an ráta caighdeánach a fháil

source: The website studentfinance.ie has detailed information on the range of grants and funds for students in further and higher education
ga: Tá faisnéis mionsonraithe faoi dheontais agus chistí do mhic léinn san ardoideachas agus breisoideachas ar an suíomh gréasáin studentfinance.ie

source: Schemes to help with fees and maintenance
ga: Scéimeanna a chabhraíonn le táillí agus cothabháil

source: If you satisfy certain criteria and attend courses approved by the Department of Education and Skills, you may qualify for help with fees and maintenance throughout the period of your studies
ga: Má shásaíonn tú critéir áirithe agus má fhreastalaíonn tú ar chúrsaí atá formheasta ag an Roinn Oideachais agus Scileanna, tá sé de cheart agat cabhair a fháil leis na táillí agus leis an gcothabháil i rith tréimhse do staidéir

source: Since 2011, a single Student Grant Scheme is in operation
ga: Ó 2011, tá Scéim um Dheontais do Mhic Léinn nua singil ann

source: The following support schemes that applied to mature students have been merged into this single scheme:
ga: Tá scéimeanna tacaíochta seo leanas a bhain le mic léinn lánfhásta comhcheangailte sa scéim nua seo:

source: • Vocational Education Committees' Scholarship Scheme
ga: • Scéim Scoláireachta an Choiste Gairmoideachais

source: Since 2011, mature students who get student grants no longer automatically qualify for the higher (non-adjacent) rate of grant
ga: Ó 2011 má fhaigheann mic léinn lánfhásta deontais mhic léinn ní bheidh siad incháilithe go huathoibríoch chun an ráta deontais níos airde (neamh-chóngarach) a fháil

source: From 2012 onwards, new postgraduate students will not qualify for a full student grant
ga: Ó 2012 ar aghaidh, ní bheidh mic léinn iarchéime incháilithe chun deontas mic léinn iomlán a fháil

source: If you are getting an unemployment, one-parent family or disability payment, the Back to Education Allowance (BTEA) allows you to study at second and third level without losing your benefits
ga: Má fhaigheann tú íocaíocht dífhostaíochta, íocaíocht do theaghlach aontuismitheora nó íocaíocht do mhíchumas, tugann an Liúntas um Fhilleadh ar Oideachas (LFO) deis duit staidéar dara leibhéil nó tríú leibhéil a dhéanamh gan na sochair a chailleadh

source: You must meet certain criteria to be eligible for the BTEA
ga: Ní mór duit critéir áirithe a shásamh le bheith i dteideal an Liúntas um Fhilleadh ar an Oideachas a fháil

source: If you are studying part-time you may be able to keep your benefits under the Back to Education Programme
ga: Má dhéanann tú staidéar páirtaimseartha, d’fhéadfadh go gcoinneofá do shochair faoin Chlár um Filleadh ar Oideachas

source: Since 2010, people who are getting Back to Education Allowance and those on Post-Leaving Certificate courses who are getting VTOS allowances are not eligible for student support grants
ga: Ó 2011 ar aghaidh, daoine atá ag fáil Liúntas um Fhilleadh ar Oideachas agus iad ar chúrsaí Iar-Ardteistiméireachta atá ag fáil liúntais SDOG ní bheidh siad i dteideal deontas tacaíochta mac léinn

source: However, this does not affect any entitlement they may have to exemption from college fees or the Student Contribution so they should still complete a grant application
ga: Áfach, ní bheidh aon tionchar ar a dteidlíocht le haghaidh díolúine ó tháillí choláiste nó an Ranníocaíocht Mic Léinn agus ba chóir dóibh foirm iarratais ar dheontas a chomhlánú

source: Read more about the Student Grant Scheme and about social welfare payments and the student grant
ga: Léigh tuilleadh faoin Scéim Deontas do Mhic Léinn agus faoi íocaíochtaí leasa shóisialaigh agus an deontas mac léinn

source: There are several other funds available to support you in third-level education
ga: Ina theannta sin, tá roinnt cistí eile ar fáil le cabhrú leat agus tú ag filleadh ar an oideachas tríú leibhéil

source: Fund for students with disabilities
ga: Ciste speisialta do mhic léinn faoi mhíchumas

source: If you have a disability, you may be entitled to some financial support
ga: Má tá míchumas fisiciúil ort, féadann tú a bheith i dteideal tacaíochta airgeadais

source: The Department of Education and Skills administers a special fund that helps students with disabilities during the period of their studies
ga: Tá ciste speisialta á riaradh ag an Roinn Oideachais agus Scileanna a thugann cabhair do mhic léinn faoi mhíchumas fisiciúil tríd a dtréimhse staidéir

source: The Student Assistance Fund is for students who, having started a third-level course, experience financial hardship and, therefore, may be unable to continue their studies
ga: Cuidíonn an Ciste Cúnta do Mhic Léinnseo le mic léinn a dtagann cruatan airgeadais orthu tar éis dóibh tosú ar chúrsa tríú leibhéal agus ar baol dóibh dá bharr gan a bheith in ann leanúint dá gcuid staidéar tríú leibhéal

source: Applications for funding should be made by the individual student to the access/disability officer in their college
ga: Ba cheart don mhac léinn féin an t-iarratas ar mhaoiniú a dhéanamh leis an oifigeach rochtana/míchumais ina institiúid féin

source: The Fund is administered on a confidential, discretionary basis
ga: Riartar an Ciste Cúnta do Mhic Léinn ar bhonn rúnda lánroghnach

source: If you plan to study abroad, you may be eligible for a student grant from the Irish Government
ga: Má tá sé ar intinn agat staidéar a dhéanamh thar lear, féadfaidh tú a bheith i dteideal an deontas cothabhála a fháil ó Rialtas na hÉireann

source: A range of approved undergraduate courses in the UK and in other European Union states are covered
ga: Tá réimse cúrsaí fochéime formheasta sa Ríocht Aontaitheagus i stáit eile san Aontas Eorpach i gceist

source: Find out more about European education programmes
ga: Tá réimse cáipéisí ag baint le Cláir Oideachais Eorpacha agus d'fhéadfaidís a bheith ina ndíol suime duit

source: Under the Student Grant Scheme there are no age limits for the student grants for studying in another EU state but it must be your first undergraduate course
ga: Faoin Scéim um Dheontas do Mhic Léinn níl aon aoisteorainn do na deontais chothabhála le staidéar i stát eile san AE ach caithfidh gurb é do chéad chúrsa fochéime

source: Generally each college has a mature students officer who can provide information about supports for mature students
ga: Go ginearálta, tá oifigeach ag gach coláiste do na mic léinn lánfhásta agus is féidir leis/léi eolas a chur ar fáil faoi thacaíocht do mhic léinn lánfhásta

source: The Special Fund for People with Disabilities
ga: An Ciste Speisialta do Dhaoine faoi Mhíchumas

source: You need to contact the Student Counsellor or Disability Support Officer at the college of your choice when you are registering
ga: Ní mór duit teagmháil a dhéanamh le Comhairleoir na Mac Léinn nó le hOifigeach Tacaíochta Míchumais ag an gcoláiste a roghnaigh tú nuair a bheidh tú ag clárú

source: If you are a citizen of the European Union, you have the right to go to any other EU state to study
ga: Más saoránach den Aontas Eorpach tú, tá sé de rogha agat dul go dtí aon tír san AE le staidéar a dhéanamh

source: The EU has published a series of guides about living, working, studying and moving within the EU which will explain your rights
ga: D'fhoilsigh an tAE roinnt treoirleabhair faoi mhaireachtáil, obair, staidéar agus bogadh laistigh den AE agus míneoidh sé do chearta

source: You can then make the most of the opportunities available to you
ga: Ansin, is féidir leat an tairbhe is fearr a bhaint as na deiseanna atá ar fáil duit

source: If you are interested in studying in the UK, for example, you should contact the British Council in order to get full information on the courses available and the application procedures for each course
ga: Má tá suim agat i staidéar a dhéanamh sa Ríocht Aontaithe mar shampla, ba cheart duit dul i dteagmháil le Comhairle na Breataine agus gheobhaidh tú eolas iomlán ar na cúrsaí atá ar fáil agus ar na nósanna imeachta iarratais do gach cúrsa

source: If you are interested in studying outside of the EU, you should get in touch with the Irish embassy/consulate in that state for further information
ga: Má tá spéis agat i staidéar a dhéanamh i dtír lasmuigh den AE, ba cheart duit teagmháil a dhéanamh leis an ambasáid/consalacht Éireannach sa tír úd chun tuilleadh eolais a fháil

source: Since 2012-2013 on, Student Universal Support Ireland (SUSI) handles all new applications for student grants. Renewals of existing grants are handled by the VEC or local authority that issued them initially
ga: Ó 2012-2013 ar aghaidh, láimhseálann Tacaíocht Uilíoch do Mhic Léinn Éire (SUSI) gach iarratas ar dheontas mac léinn nua.Tá athnuachan deontais reatha láimhseáilte ag an údarás áitiúil nó CGO a d’eisigh iad ar dtús

source: Since 1 July 2013, VEC were replaced by Education and Training Boards (ETBs)
ga: Ó 1 Iúil 2013, cuirfear Boird Oideachais agus Oiliúna (BOO) in áit CGO

source: All new grant applications must be made online
ga: Caithfidh gach iarratas ar dheontas mac léinn nua bheith déanta ar líne

source: Back to Education Programme
ga: An Clár um Fhilleadh ar Oideachas

source: For the Back to Education Allowance or other strands of the Back to Education Programme, apply on form BTE1 (pdf)
ga: Déan iarratas ar fhoirm BTE1 (pdf) chun an Liúntas um Fhilleadh ar Oideachas nó sraitheanna eile don Chlár um Fhiileadh ar Oideachas

source: Contact the mature students officer or the admissions officer at the college of your choice
ga: Déan teagmháil le oifigeach na mac léinn lánfhásta nó leis an oifigeach iontrála ag an gcoláiste atá roghnaithe agat

source: Make your online application for a grant through SUSI
ga: Déan d’iarratas ar líne trí Thacaíocht Uilíoch do Mhic Léinn, Éire (SUSI)

source: For the Back to Education Programme, send the form to the office that deals with applications from people on your particular payment
ga: Don Chlár um Fhilleadh ar Oideachas, seol an fhoirm chuig an oifig a dhéileálann le hiarratais ó dhaoine a fhaigheann d'íocaíocht ar leith

source: These offices are listed on the back of the form
ga: Tá na hoifigí liostaithe ar chúl na foirme

source: For the Special Fund for People with Disabilities, apply to the Student Counsellor or Disability Support Officer at the college of your choice
ga: Don Chiste Speisialta do Dhaoine faoi Mhíchumas, is féidir iarratas a dhéanamh chuig Comhairleoir na Mac Léinn nó chuig an Oifigeach Tacaíochta Míchumais ag an gcoláiste atá roghnaithe agat
